# Rebar Create Free Form(Document, Rebar Bar Type, Element, IList Curve Loop , Rebar Style) Method

Source: https://www.revitapidocs.com/2026/f923c32b-c80e-e682-5f19-11399fbec3d0.htm

---

| Rebar Create Free Form(Document, Rebar Bar Type, Element, IList Curve Loop , Rebar Style) Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static RebarFreeFormCreationResult CreateFreeForm(
	Document doc,
	RebarBarType barType,
	Element host,
	IList<CurveLoop> curves,
	RebarStyle style
)
```

```
Public Shared Function CreateFreeForm (
	doc As Document,
	barType As RebarBarType,
	host As Element,
	curves As IList(Of CurveLoop),
	style As RebarStyle
) As RebarFreeFormCreationResult
```

```
public:
static RebarFreeFormCreationResult^ CreateFreeForm(
	Document^ doc,
	RebarBarType^ barType,
	Element^ host,
	IList<CurveLoop^>^ curves,
	RebarStyle style
)
```

```
static member CreateFreeForm :
        doc : Document *
        barType : RebarBarType *
        host : Element *
        curves : IList<CurveLoop> *
        style : RebarStyle -> RebarFreeFormCreationResult
```

#### Parameters

doc Document
barType RebarBarType
host Element
curves IList CurveLoop
style RebarStyle

#### Return Value

RebarFreeFormCreationResult See Also

#### Reference

Rebar Class CreateFreeForm Overload Autodesk.Revit.DB.Structure Namespace